Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus has built-in support for JSON serialization and deserialization based on Jackson. It will also xref:serialization-generation[generate] the serializer and deserializer for you, so you do not have to configure anything. When generation is disabled, you can use the provided `ObjectMapperSerializer` and `ObjectMapperDeserializer` as explained below.
ja_jp: Quarkusには、Jacksonに基づくJSONシリアライズとデシリアライズのサポートが組み込まれています。また、シリアライザーとデシリアライザーを xref:serialization-generation[生成して] くれるため、何も設定する必要がありません。生成が無効の場合は、以下に説明するように、提供されている `ObjectMapperSerializer` と `ObjectMapperDeserializer` を使用することができます。

source: Quarkus has excellent https://quarkus.io/guides[documentation^] and https://github.com/quarkusio/quarkus-quickstarts[quickstarts^] to help developers become familiar with various features in the Quarkus ecosystem. However, what was missing was a fully-implemented sample set of real-world applications that use these features, patterns, and best practices while also reflecting problems Quarkus is trying to solve.
ja_jp: Quarkusには、開発者がQuarkusエコシステムのさまざまな機能に慣れるための優れた link:https://quarkus.io/guides[ドキュメント, window=_blank]や link:https://github.com/quarkusio/quarkus-quickstarts[クイックスタート, window=_blank]があります。しかし、不足していたのは、これらの機能、パターン、ベストプラクティスを使用しながら、Quarkusが解決しようとしている問題を反映した、完全に実装された実世界のアプリケーションのサンプルセットでした。

source: Quarkus has great performance – and we have new evidence
ja_jp: Quarkusは素晴らしいパフォーマンスを発揮します。その新たな証拠があります

source: Quarkus has limited support for `@Repeatable` interceptor binding annotations.
ja_jp: Quarkusでは、 `@Repeatable` インターセプター結合アノテーションのサポートが制限されています。

source: Quarkus has long supported both JVM and native image modes, each optimized for different trade-offs. Native image delivers unmatched startup and footprint. JVM mode offers peak throughput, dynamic capabilities, and a mature tooling ecosystem.
ja_jp: Quarkus は、それぞれ異なるトレードオフに最適化された JVM モードとネイティブイメージモードの両方を長年サポートしてきました。ネイティブイメージは、比類のない起動時間とフットプリントを実現します。JVM モードは、ピークスループット、動的な機能、成熟したツールエコシステムを提供します。

source: Quarkus has more Spring compatibility features. See the following guides for more details:
ja_jp: Quarkusには、より多くのSpring互換機能があります。詳細については、以下のガイドを参照してください。

source: Quarkus has the following ClassLoaders:
ja_jp: Quarkus には以下のClassLoadersがあります:

source: Quarkus has you covered either way:
ja_jp: Quarkus では、どちらにも対応できます。

source: Quarkus has, since its genesis, has been able to serve HTTP API. The inclusion of https://resteasy.github.io/[RESTEasy] has been a major milestone of the first Quarkus beta releases. With RESTEasy _classic_, you develop HTTP APIs using the well-known JAX-RS annotations such as `@GET`, `@Path`, `@POST`... The following snippet shows a short _hello world_ example:
ja_jp: Quarkusは、その誕生以来、HTTP APIを提供することができました。 link:https://resteasy.github.io/[RESTEasy]の搭載は、Quarkusの最初のベータリリースの主要なマイルストーンでした。RESTEasy _classic_ では、 `@GET`, `@Path`, `@POST`...のようなよく知られたJAX-RSアノテーションを使用してHTTP APIを開発します。

source: Quarkus heavily utilizes https://github.com/smallrye/jandex[Jandex] at build time, to discover various classes or annotations. One immediately recognizable application of this, is CDI bean discovery. As a result, most of the Quarkus extensions will not work properly if this build time discovery isn't properly setup.
ja_jp: Quarkusはビルド時に link:https://github.com/smallrye/jandex[Jandex] を多用し、様々なクラスやアノテーションを発見します。このアプリケーションですぐに認識できるのは、CDIビーンの検出です。その結果、Quarkusのエクステンションのほとんどは、このビルド時のディスカバリーが適切に設定されていないと正しく動作しません。

source: Quarkus heavily utilizes https://github.com/wildfly/jandex[Jandex] at build time, to discover various classes or annotations. One immediately recognizable application of this, is CDI bean discovery. As a result, most of the Quarkus extensions will not work properly if this build time discovery isn't properly setup.
ja_jp: Quarkus はビルド時に https://github.com/wildfly/jandex[Jandex] を多用して、さまざまなクラスやアノテーションを発見しています。これをすぐに認識できるアプリケーションの1つは、CDI Beanのディスカバリーです。 その結果、このビルド時のディスカバリーが適切に設定されていないと、Quarkusのエクステンションのほとんどが正しく動作しません。

source: Quarkus however, can overcome these limitations when `quarkus.arc.transform-unproxyable-classes` is set to `true` (which is the default value).
ja_jp: しかし、Quarkus では、 `quarkus.arc.transform-unproxyable-classes` を `true` (デフォルト値) に設定すると、これらの制限を抑制することができます。

source: Quarkus includes a CORS filter at the HTTP layer level. For more information about the CORS filters and their usage, see the xref:security-cors.adoc#cors-filter[CORS filter] section of the Quarkus "Cross-origin resource sharing" guide.
ja_jp: Quarkus には、HTTP レイヤーレベルの CORS フィルターが含まれています。 CORS フィルターとその使用方法の詳細は、Quarkus のクロスオリジンリソース共有ガイドの xref:security-cors.adoc#cors-filter[CORS フィルター] セクションを参照してください。

source: Quarkus includes an extension that allows developers to use Kubernetes ConfigMaps and Secrets as a configuration source, without having to mount them into the Pod running the Quarkus application or make any other modifications to their Kubernetes Deployment (or Openshift DeploymentConfig).
ja_jp: Quarkusには、Kubernetes ConfigMapsとSecretsを設定ソースとして使用できるエクステンションが含まれており、Quarkusアプリケーションを実行しているPodにそれらをマウントしたり、Kubernetes Deployment (またはOpenshift DeploymentConfig) に他の変更を加えたりする必要はありません。

source: Quarkus includes built-in security to allow xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[authorization using annotations] when the Vert.x gRPC support, which uses existing Vert.x HTTP server, is enabled.
ja_jp: Quarkus には、既存の Vert.x HTTP サーバーを使用する Vert.x gRPC サポートが有効な場合に、xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[アノテーションを使用した認可] を可能にする組み込みのセキュリティーが含まれています。

source: Quarkus includes support for graceful shutdown, this allows Quarkus to wait for running requests to finish, up till a set timeout. By default this is disabled, however you can configure this by setting the `quarkus.shutdown.timeout` config property. When this is set shutdown will not happen until all running requests have completed, or until this timeout has elapsed. This config property is a duration, and can be set using the standard `java.time.Duration` format, if only a number is specified it is interpreted as seconds.
ja_jp: これにより、Quarkusは、実行中のリクエストが終了するまで、設定されたタイムアウトまで待機することができます。デフォルトでは無効になっていますが、 `quarkus.shutdown.timeout` configプロパティーを設定することで設定することができます。これが設定されている場合、すべての実行中のリクエストが完了するまで、またはこのタイムアウトが経過するまでシャットダウンは行われません。この設定プロパティーは持続時間であり、標準の `java.time.Duration` 形式で設定することができます。

source: Quarkus includes support for graceful shutdown, this allows Quarkus to wait for running requests to finish, up till a set timeout. By default, this is disabled, however you can configure this by setting the `quarkus.shutdown.timeout` config property. When this is set shutdown will not happen until all running requests have completed, or until this timeout has elapsed. This config property is a duration, and can be set using the standard `java.time.Duration` format, if only a number is specified it is interpreted as seconds.
ja_jp: Quarkusはグレースフルシャットダウンをサポートします。Quarkusは、設定されたタイムアウトまで、実行中のリクエストが終了するのを待つことができます。デフォルトでは無効になっていますが、 `quarkus.shutdown.timeout` 設定プロパティを設定することで設定可能です。このプロパティを設定すると、実行中のリクエストがすべて完了するか、タイムアウトが経過するまでシャットダウンは行われません。このプロパティは継続時間であり、標準の `java.time.Duration` 形式で設定できます。

source: Quarkus includes support for graceful shutdown, this allows Quarkus to wait for running requests to finish, up till a set timeout. By default, this is disabled, however you can configure this by setting the `quarkus.shutdown.timeout` config property. When this is set shutdown will not happen until all running requests have completed, or until this timeout has elapsed.
ja_jp: Quarkusがグレースフルシャットダウンのサポートを追加しました。これにより、Quarkusは実行中のリクエストが終了するまで、設定されたタイムアウトまで待機することができます。 デフォルトでは無効になっていますが、 `quarkus.shutdown.timeout` コンフィグプロパティを設定することで設定できます。 これを設定すると、実行中のリクエストがすべて完了するか、タイムアウトが経過するまでシャットダウンは行われません。

source: Quarkus includes the `kubernetes-client` extension which enables the use of the https://github.com/fabric8io/kubernetes-client[Fabric8 Kubernetes Client] in native mode while also making it easier to work with.
ja_jp: Quarkusには、 link:https://github.com/fabric8io/kubernetes-client[Fabric8 Kubernetesクライアント] をネイティブモードで使用できるようにする `kubernetes-client` エクステンションが含まれています。

source: Quarkus includes the `kubernetes-config` extension which allows developers to use Kubernetes https://cloud.google.com/kubernetes-engine/docs/concepts/configmap[ConfigMaps] and https://cloud.google.com/kubernetes-engine/docs/concepts/secret[Secrets] as a configuration source, without having to mount them into the https://kubernetes.io/docs/concepts/workloads/pods/pod/[Pod] running the Quarkus application or make any other modifications to their Kubernetes `Deployment` (or OpenShift `DeploymentConfig`).
ja_jp: Quarkusには、 `kubernetes-config` エクステンションが含まれており、開発者は https://cloud.google.com/kubernetes-engine/docs/concepts/configmap[ConfigMaps] と https://cloud.google.com/kubernetes-engine/docs/concepts/secret[Secrets] を Quarkusアプリケーションを実行している link:https://kubernetes.io/docs/concepts/workloads/pods/pod/[Pod] にマウントしたり、Kubernetes `Deployment` (あるいは OpenShift `DeploymentConfig`)に何の変更もしなくても設定ソースとして使用することができます。

source: Quarkus incorporates a pluggable web security layer.
ja_jp: Quarkusには、プラグイン可能なWebセキュリティレイヤーが組み込まれています。

source: Quarkus incorporates a pluggable web security layer. When security is active, the system performs a permission check on all HTTP requests to determine if they should proceed.
ja_jp: Quarkus には、プラグ可能な Web セキュリティーレイヤーが組み込まれています。 セキュリティーがアクティブな場合、システムはすべての HTTP リクエストに対して権限チェックを実行し、続行するかどうかを決定します。

source: Quarkus incorporates build-time optimizations in order to provide instant startup and low memory footprint. The downside of this approach is that CDI Portable Extensions cannot be supported. Nevertheless, most of the functionality can be achieved using Quarkus xref:writing-extensions.adoc[extensions]. See the xref:cdi-integration.adoc[integration guide] for more information.
ja_jp: Quarkus は、インスタント起動と低メモリフットプリントを提供するために、ビルド時の最適化を取り入れています。このアプローチの欠点は、CDI ポータブル・エクステンションをサポートできないことです。それにもかかわらず、ほとんどの機能は、Quarkus xref:writing-extensions.adoc[エクステンション] を使用して行うことができます。詳細は、xref:cdi-integration.adoc[integration guide] を参照してください。

source: Quarkus information resource
ja_jp: Quarkus の情報リソース

source: Quarkus instructs Mandrel to initialize as much as possible at build time, so that runtime startup can be as fast as possible. This is important in containerized environments where the startup speed has a big impact on how quickly an application is ready to do work. Build time initialization also minimizes the risk of runtime failures due to unsupported features becoming reachable through runtime initialization, thus making Quarkus more reliable.
ja_jp: QuarkusはMandrelに対し、ビルド時に可能な限り初期化するよう指示し、実行時の起動を可能な限り高速化しています。これは、起動速度がアプリケーションの動作準備の早さに大きな影響を与えるコンテナ環境では重要です。また、ビルド時の初期化は、サポートされていない機能が実行時の初期化によって到達可能になることによる実行時の失敗のリスクを最小限にし、Quarkusの信頼性を高めています。

source: Quarkus integration tests (annotated with `@QuarkusIntegrationTest`) will run on the artifact produced by Quarkus. Those tests can be placed in a `src/integrationTest/java` directory and executed using:
ja_jp: （ `@QuarkusIntegrationTest` でアノテーションされた）Quarkus結合テストは、Quarkusが生成したアーティファクトで実行されます。これらのテストは、 `src/integrationTest/java` ディレクトリに配置し、それを使用して実行することができます。

source: Quarkus introduces an experimental `Dev Services For Keycloak` feature which is enabled by default when the `quarkus-oidc` extension is started in dev mode and when the integration tests are running in test mode, but only when no `quarkus.oidc.auth-server-url` property is configured. It starts a Keycloak container for both the dev and/or test modes and initializes them by registering the existing Keycloak realm or creating a new realm with the client and users for you to start developing your Quarkus application secured by Keycloak immediately. It will restart the container when the `application.properties` or the realm file changes have been detected.
ja_jp: Quarkus は、実験的な `Dev Services For Keycloak` 機能を導入しています。これは、 `quarkus-oidc` エクステンションが開発モードで起動され、統合テストがテストモードで実行されている場合にデフォルトで有効になります。ただし、 `quarkus.oidc.auth-server-url` プロパティが設定されいていない場合に限ります。開発モードかテストモード、あるいはその両方で Keycloak コンテナーを起動し、既存の Keycloak レルムを登録するか、クライアントとユーザーで新しいレルムを作成して初期化することで、Keycloak で保護された Quarkus アプリケーションの開発をすぐに開始します。 `application.properties` またはレルムファイルの変更が検出されると、コンテナーが再起動します。

source: Quarkus is a Cloud Native, Container First framework for writing Java applications.
ja_jp: Quarkusは、Javaアプリケーションを書くためのクラウドネイティブ、コンテナーファーストのフレームワークです。

source: Quarkus is a _Reactive_ framework. Since the beginning, _Reactive_ has been an essential tenet of the Quarkus architecture. It includes many reactive features and offers a broad ecosystem.
ja_jp: Quarkusは _Reactive_ フレームワークです。当初から、 _Reactive_はQuarkusのアーキテクチャに欠かせない要素でした。多くのReactive機能が含まれており、幅広いエコシステムを提供しています。

source: Quarkus is a build-time oriented stack, i.e. it tries to do as much as possible at build time to improve the startup time and memory usage of your application. However, it's not always so easy and straightforward as many existing frameworks and libraries do not take this design choice into account. And CDI is one of them.
ja_jp: Quarkusはビルド時重視のスタックです。つまり、アプリケーションの起動時間とメモリ使用量を改善するために、ビルド時に可能な限りのことをしようとします。しかし、既存のフレームワークやライブラリの多くがこの設計上の選択を考慮していないため、必ずしも簡単でわかりやすいものではありません。CDIはその一つです。

source: Quarkus is a highly specialized framework, with extensive build-time processing and optimizations. Project Leyden is a specialized technology as well, with its own constraints and requirements.
ja_jp: Quarkus は、広範なビルド時処理と最適化を備えた、非常に特化したフレームワークです。Project Leyden もまた、独自の制約と要件を持つ特化されたテクノロジーです。

source: Quarkus is able to also cache `null` values unlike the underlying Caffeine provider. See <<negative-cache,more on this topic below>>.
ja_jp: Quarkusは、基礎となるCaffeineプロバイダとは異なり、 `null` の値をキャッシュすることもできます。 link:#negative-cache[このトピックの詳細は以下] を参照してください。

source: Quarkus is able to also cache `null` values unlike the underlying Caffeine provider. See xref:negative-cache[more on this topic below].
ja_jp: Quarkusは、基盤となるCaffeineプロバイダーとは異なり、 `null` 値をキャッシュすることも可能です。 xref:negative-cache[このトピックについては、以下] を参照してください。

source: Quarkus is an Open Source project licensed under the <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>. First and foremost, it is an open community where contributions, ideas and discussions are done in the open and contributors are welcome. Let’s join forces in building the future of Java applications.
ja_jp: Quarkusは<a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>でライセンスされるオープンソースプロジェクトです。何よりもまず、オープンなコミュニティであり、貢献、アイデア、ディスカッションに対してオープンであり、コントリビューターを歓迎します。Javaアプリケーションの将来を築く為に、協力していきましょう。

source: Quarkus is an Open Source project licensed under the https://www.apache.org/licenses/LICENSE-2.0[Apache License version 2.0].
ja_jp: Quarkusは https://www.apache.org/licenses/LICENSE-2.0[Apache License version 2.0] でライセンスされているオープンソースプロジェクトです。

source: Quarkus is an ecosystem made from many extensions and many libraries (like Eclipse Vert.x, Hibernate, Apache Camel and more), most of them not under the direct responsibility of the Quarkus team. If you find a security bug possibly rooted in one of these libraries, you can either disclose to them directly or disclose them to the Quarkus team (following this process) and we will responsibly disclose the issue to the respective extension or library maintainer.
ja_jp: Quarkusは、多くのエクステンションと多くのライブラリ(Eclipse Vert.x、Hibernate、Apache Camelなど)からなるエコシステムであり、そのほとんどはQuarkusチームの直接の責任下にはありません。これらのライブラリに根ざしている可能性のあるセキュリティーバグを見つけた場合は、それらのライブラリに直接開示するか、Quarkusチームに開示することが出来(このプロセスに従ってください)、その場合、責任を持ってそれぞれのエクステンションまたはライブラリのメンテナに開示します。

source: Quarkus is an excellent choice for both full-stack web components and full-stack microservices aka Micro-frontends. By utilizing the Web Bundler or Quinoa, you can significantly reduce boilerplate code and manage multiple services efficiently without much configuration duplication.
ja_jp: Quarkus は、フルスタック Web コンポーネントとフルスタックマイクロサービス (マイクロフロントエンドとも呼ばれます) の両方に最適です。Web Bundler または Quinoa を利用することで、ボイラープレートコードを大幅に削減し、設定の重複をほとんど発生させずに複数のサービスを効率的に管理できます。

source: Quarkus is an open ecosystem and we hope to see all the extensions people need to write their apps. We are working as we speak to allow an extension to be published in separate repos and separate GAVs and thus published in Maven repos independently of Quarkus core. This will greatly simplify the publication process. Expect news soon.
ja_jp: Quarkusはオープンエコシステムであり、人々がアプリを作成するために必要なすべてのエクステンションが存在することを期待しています。エクステンションを個別のリポジトリと個別のGAVで公開し、Quarkusコアとは独立してMavenリポジトリで公開できるようにするために取り組んでいます。これにより、公開プロセスが大幅に簡素化されます。近いうちのニュースを期待してください。

source: Quarkus is built on reactive principles, using an efficient asynchronous, non-blocking engine based on Netty and Eclipse Vert.x. It employs a few event loops instead of a large thread pool, reducing resource usage and improving response times by optimizing for hardware behavior.
ja_jp: Quarkusは、NettyとEclipse Vert.xに基づいた効率的な非同期・ノンブロッキングエンジンを使用するリアクティブ原則に基づいて構築されています。多数のスレッドプールではなく、少数のイベントループを採用することで、リソース使用量を削減し、ハードウェアの動作を最適化して応答時間を改善します。

source: Quarkus is dedicated to continuously improving performance, especially for code running on the critical execution (hot) path. Through ongoing optimizations, Quarkus ensures that every instruction and allocated byte matters, making it one of the most efficient frameworks available for developing <a href="https://www.techempower.com/benchmarks/#hw=ph&test=fortune&section=data-r22&c=e&f=0-0-0-0-0-0-0-0-0-2-4zsow-0-0-0-0&l=5181v-6bl">high-performance, cloud-ready applications.</a>
ja_jp: Quarkusは、特にクリティカルな実行（ホット）パスで実行されるコードのパフォーマンスを継続的に改善することに専念しています。継続的な最適化を通じて、Quarkusはすべての命令と割り当てられたバイトが重要であることを保証し、<a href="https://www.techempower.com/benchmarks/#hw=ph&test=fortune&section=data-r22&c=e&f=0-0-0-0-0-0-0-0-0-2-4zsow-0-0-0-0&l=5181v-6bl">高性能なクラウド対応アプリケーション</a>を開発するための最も効率的なフレームワークの1つにしています。

source: Quarkus is designed to be a Kubernetes-native runtime. Extensions can continue this philosophy by adding library-specific integration points with Kubernetes. Being Kubernetes-native implies being container-native. At a minimum, extensions should always work well in containers, but extensions may also have opportunities to integrate with the lower levels of the container stack.
ja_jp: Quarkus は Kubernetes ネイティブランタイムとして設計されています。 エクステンションは、Kubernetes とのライブラリー固有の統合ポイントを追加することで、この思想を確保できます。 Kubernetes ネイティブであることは、コンテナーネイティブであることを意味します。少なくとも、エクステンションは常にコンテナー内で適切に機能する必要がありますが、エクステンションにはコンテナースタックの下位レベルと統合する機会もあります。

source: Quarkus is designed to seamlessly combine the familiar imperative style code and the non-blocking, reactive style when developing applications.
ja_jp: Quarkus は、アプリケーション開発時に、なじみのある命令型スタイルのコードと、ノンブロッキングのリアクティブ型スタイルをシームレスに組み合わせるように設計されています。

source: Quarkus is engineered to be efficient by using build-time optimizations and a reactive core to achieve fast startup times, high throughput, low response latency, reduced memory footprint, and minimal resource consumption. As a result, Quarkus is fast... real fast.
ja_jp: Quarkusは、ビルド時の最適化とリアクティブコアを使用することで効率的に設計されており、高速な起動時間、高いスループット、低い応答レイテンシー、削減されたメモリフットプリント、最小限のリソース消費を実現します。その結果、Quarkusは高速です...非常に高速です。

source: Quarkus is first and foremost a Java framework, that means you can develop, package and run classic JAR applications, that's what we call *JVM mode*.
ja_jp: Quarkus は最初の Java フレームワークです。つまり、従来の *JAR* アプリケーションの開発、パッケージ化、実行を行うことができます。これは、*JVM モード* と呼ばれます。

source: Quarkus is first and foremost a Java framework, that means you can develop, package, and run classic JAR applications, that's what we call *JVM mode*.
ja_jp: Quarkus は何よりもまず Java フレームワークです。つまり、従来の JAR アプリケーションを開発、パッケージ化、実行できます。これを *JVM モード* と呼びます。

source: Quarkus is ideal for AI applications due to its performance, agility, and developer experience. It offers native Generative AI integration via LangChain4j, supporting declarative AI services, various LLMs, and advanced prompt engineering. It also handles predictive AI and data pipeline automation with ML toolkits for scalable ETL and embedding workflows. Quarkus's "AI-Enhanced Developer Experience" provides fast startups, low memory, and a reactive core for cloud-native AI. It boosts developer velocity with live coding, a unified Java stack, and robust observability/security for reliable AI services.
ja_jp: Quarkusは、そのパフォーマンス、俊敏性、開発エクスペリエンスにより、AIアプリケーションに理想的です。LangChain4jを介したネイティブな生成AI統合を提供し、宣言型AIサービス、多様なLLM、および高度なプロンプトエンジニアリングをサポートします。また、スケーラブルなETLおよび埋め込みワークフローのためのMLツールキットを使用して、予測AIとデータパイプラインの自動化も処理します。Quarkusの「AI強化開発エクスペリエンス」は、高速起動、低メモリー使用量、クラウドネイティブAIのためのリアクティブコアを提供します。ライブコーディング、統一されたJavaスタック、堅牢な可観測性/セキュリティにより、信頼性の高いAIサービスのための開発者の速度を向上させます。

source: Quarkus is inherently reactive thanks to its reactive engine. But, you, as an application developer, don't have to write reactive code. Quarkus unifies reactive and imperative. It means that you can write traditional blocking applications on Quarkus. But how do you avoid blocking the I/O threads? Quarkus implements a https://en.wikipedia.org/wiki/Proactor_pattern[proactor pattern] that switches to worker thread when needed.
ja_jp: Quarkusは、リアクティブエンジンを搭載しているため、本質的にリアクティブです。しかし、アプリケーション開発者としては、リアクティブなコードを書く必要はありません。Quarkusはリアクティブ型と命令型を統合しています。つまり、従来のブロッキングアプリケーションをQuarkusで書くことができるのです。しかし、I/Oスレッドをブロックしないようにするにはどうすればいいのでしょうか？Quarkusでは、必要に応じてワーカースレッドに切り替える link:https://en.wikipedia.org/wiki/Proactor_pattern[プロアクターパターン]を実装しています。

source: Quarkus is made of community projects
ja_jp: Quarkusはコミュニティプロジェクトで構成されています

source: Quarkus is not affected by CVE-2021-44228.
ja_jp: Quarkusは、CVE-2021-44228の影響を受けません。

source: Quarkus is not affected by the Log4J Vulnerability
ja_jp: QuarkusはLog4Jの脆弱性の影響を受けません。

source: Quarkus is not currently producing metrics out of the box. Here we are creating a counter for the number of invocations of the `hello()` method.
ja_jp: Quarkus では現在、すぐに使用できるメトリクスは生成されません。 ここでは、 `hello()` メソッドの呼び出し回数のカウンターを作成しています。

source: Quarkus is not just about being great for writing Web Applications or Micro-Services. We’re focusing on more than the feature set: we make sure that every feature works well, simply, with little to no configuration, in the most intuitive way possible. It should be trivial to develop simple things, and easy to develop the more complex ones.
ja_jp: Quarkusは、単にWebアプリケーションやマイクロサービスを書くのに適しているというだけではありません。私たちは、機能セット以上のものを重視しています。すべての機能が、可能な限り直感的な方法で、ほとんど設定をすることなく、シンプルにうまく機能するようにしています。シンプルなものを開発するのはごく簡単で、複雑なものを開発するのは容易でなければなりません。

source: Quarkus is not just the https://github.com/quarkusio/quarkus repository and the Quarkus platform. It is also the whole rest of the Quarkus ecosystem - the so-called Quarkiverse. Those extensions are hosted and maintained by lots of contributors and organizations around the world. Some host these extensions in their GitHub repositories, and others host them in the https://github.com/quarkiverse[Quarkiverse Hub].
ja_jp: Quarkusは、 https://github.com/quarkusio/quarkus リポジトリとQuarkusプラットフォームだけではありません。Quarkusのエコシステムの残りの部分全体、いわゆるQuarkiverseでもあります。エクステンションは、世界中の多くのコントリビューターや組織によってホストされ、維持されています。GitHubリポジトリでエクステンションをホストしている人もいれば、 link:https://github.com/quarkiverse[Quarkiverse Hub] でホストしている人もいます。

source: Quarkus is not limited to HTTP. You can use <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> or <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, two prominent alternatives in the microservice space.
ja_jp: Quarkusは、HTTPに限定されません。マイクロサービス分野の2つの有力な選択肢である<a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a>や<a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>を使用することができます。

source: Quarkus is not only going to help you build reactive systems. It's also going to make sure that each constituent enforces the reactive principles and is highly efficient.
ja_jp: Quarkusは、リアクティブなシステムの構築を支援するだけではありません。また、各構成要素がリアクティブ原則を実行し、非常に効率的であることも担保します。
